Revit 2027 API
OverrideGraphicSettings.IsSurfaceBackgroundPatternVisible Property
 The visibility of the surface background fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSurfaceBackgroundPatternVisible { get; }
Public ReadOnly Property IsSurfaceBackgroundPatternVisible As Boolean
	Get
public:
property bool IsSurfaceBackgroundPatternVisible {
	bool get ();
}
member IsSurfaceBackgroundPatternVisible : bool with get
Property Value
Boolean
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace